; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v6)
		(pred_4 ?v2)
		(pred_3 ?v3)
		(pred_1 ?v3)
		(pred_6 ?v2 ?v3)
		(pred_2)
		(pred_5 ?v2))

   (:action op_3
       :parameters  (?v5 ?v8)
       :precondition (and (not-eq ?v5 ?v8) 
                          (pred_3 ?v5) (pred_3 ?v8) (pred_1 ?v5))
       :effect (and  (pred_1 ?v8)
		     (not (pred_1 ?v5))))


   (:action op_1
       :parameters (?v7 ?v4)
       :precondition  (and  (pred_4 ?v7) (pred_3 ?v4)
			    (pred_6 ?v7 ?v4) (pred_1 ?v4) (pred_2))
       :effect (and (pred_5 ?v7)
		    (not (pred_6 ?v7 ?v4)) 
		    (not (pred_2))))

   (:action op_2
       :parameters  (?v7  ?v4)
       :precondition  (and  (pred_4 ?v7) (pred_3 ?v4)
			    (pred_5 ?v7) (pred_1 ?v4))
       :effect (and (pred_6 ?v7 ?v4)
		    (pred_2)
		    (not (pred_5 ?v7)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_05 obj_06 obj_07 obj_04 obj_02 obj_01 
          obj_03 obj_08 
)
(:init
(pred_3 obj_05)
(pred_3 obj_06)
(pred_3 obj_07)
(pred_3 obj_04)
(pred_3 obj_02)
(pred_3 obj_01)
(pred_4 obj_03)
(pred_4 obj_08)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(pred_2)
(pred_6 obj_03 obj_07)
(pred_6 obj_08 obj_01)
(pred_1 obj_05)
)
(:goal
(and
(pred_6 obj_03 obj_05)
(pred_6 obj_08 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_03 obj_05) (pred_1 obj_06))
    (sometime-before  (pred_6 obj_08 obj_05) (pred_1 obj_06))
  )
)
)

; plan
1. (op_3 obj_05 obj_07)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_07)
   goals met: 0 of 2
2. (op_1 obj_03 obj_07)
   deleted: (pred_6 obj_03 obj_07) (pred_2)
   added: (pred_5 obj_03)
   goals met: 0 of 2
3. (op_3 obj_07 obj_06)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_06)
   goals met: 0 of 2
4. (op_2 obj_03 obj_06)
   deleted: (pred_5 obj_03)
   added: (pred_6 obj_03 obj_06) (pred_2)
   goals met: 0 of 2
5. (op_3 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_01)
   goals met: 0 of 2
6. (op_1 obj_08 obj_01)
   deleted: (pred_6 obj_08 obj_01) (pred_2)
   added: (pred_5 obj_08)
   goals met: 0 of 2
7. (op_3 obj_01 obj_05)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_05)
   goals met: 0 of 2
8. (op_2 obj_08 obj_05)
   deleted: (pred_5 obj_08)
   added: (pred_6 obj_08 obj_05) (pred_2)
   goals met: 1 of 2
9. (op_3 obj_05 obj_06)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_06)
   goals met: 1 of 2
10. (op_1 obj_03 obj_06)
   deleted: (pred_6 obj_03 obj_06) (pred_2)
   added: (pred_5 obj_03)
   goals met: 1 of 2
11. (op_3 obj_06 obj_05)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_05)
   goals met: 1 of 2
12. (op_2 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_6 obj_03 obj_05) (pred_2)
   goals met: 2 of 2
